[
  {
    "title": "Mantis",
    "projectType": "Solo Project",

    "projectDescription": "Mantis is a singleplayer 2D side-scrolling game with a score system and timer. You play as Mantis, a top student of a prestigious fighting school suffering from burn out. She's about to start her daily exercise, but was stopped by a group of sharks who wanted to fight. She quickly pummeled them and went on with her day. Until it was revealed that they called for back up. After stealing her gym bag, they escaped into an unfinished painting. With no other choice, she followed them.",

    "projectCreation": "This project was my first introduction to Unity and game development Characters and animated cutscene were made using Adobe Animate. Other visual assets were made with paint.NET.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/F7pF-Mq0cNY",
      "title": "mantis"
    },
    "link": "n/a"
  },
  {
    "title": "Plants vs Bugs",
    "projectType": "Team Project",

    "projectDescription": "Plants vs Bugs is a singleplayer 2D top-down, tower defense game inspired by Plants vs Zombies and Bloons TD. You play as a Life Lily Farmer, an agricultural profession known for its high mortality rate because they often encounter mutated bugs. Your job is to cultivate Life Lilies to survive in this harsh world. During the day, you prepare your plot of land by planting genetically modified seeds. When nighttime falls, you must keep your lilies safe against the mutated bugs.",

    "projectCreation": "This was made in Unity with 4 other developers and 4 composers for the Game/Music Jam 2022. The theme for the jam was 'Growth'. My contributions to the project were creating all the visual assets, testing, and editing the trailer.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/ZDomwZPZMnE",
      "title": "plantsvsbugs"
    },
    "link": "https://gerzytet.itch.io/plants-vs-bugs"
  },
  {
    "title": "Abattoir",
    "projectType": "Team Project",

    "projectDescription": "Abattoir is a singleplayer 2D side-scrolling game that uses a webcam Victorian calling cards, and an optional Victorian trivia sheet to unlock doors in a dark castle. You play as a monster hunter looking for the ultimate treasure, a mummy sarcophagus. You located it in a dark tomb filled with vampires and werewolves. There are doors that are locked and the only way to open them is to scan the coresponding card by holding it in front of your webcam. Navigate the maze, collect some treasure, and claim the sarcophagus.",

    "projectCreation": "This project was created with 4 other students, and made in Unity with Vuforia for AR Image Tracking. My contributions to the project was providing code for player movement and falling platforms, creating the enemies, and testing the AR Image Tracking.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/_YFre7KWg8s",
      "title": "abattoir"
    },
    "link": "n/a"
  },
  {
    "title": "In The Bayou",
    "projectType": "Team Project",

    "projectDescription": "In The Bayou is a supernatural, horror visual novel made for the Bad Art Visual Novel Jam. You play as Mateo, a brother struggling to stay afloat with his sister because Gary's Gator Farm moved into town and taking all the customers. After rescuing one of Gary's employees, Mateo becomes afflicted with something supernatural and now becomes entangled in the supernatural balance of his swamp home.",

    "projectCreation": "This was made in Renpy with 2 other developers. The theme for the jam was 'Transformation'. My contributions to the project were programming all the dialogue and player choices.",

    "media": {
      "type": "image",
      "src": "../images/InTheBayou.png",
      "title": "in the bayou"
    },
    "link": "https://kerihalfacre.itch.io/in-the-bayou"
  },
  {
    "title": "The Trek",
    "projectType": "Solo Project",

    "projectDescription": "The Trek is a singleplayer 2D top-down game with a minimalist look and simple dialogue choices. You are about to go on The Trek, a mysterious journey that everyone has to go on. Before you depart, you can talk to other people and get their perspective on The Trek. You can choose to start your journey, or go back home.",

    "projectCreation": "This was made for the Beyond the Frontier game jam, hosted by the Game Dev and Design Club at Boise State University. The theme for the jam was 'Frontier' and submissions are individual. This was made in Unity, character portraits were drawn traditionally and edited digitally.",

    "media": {
      "type": "image",
      "src": "../images/TheTrek.png",
      "title": "the trek"
    },
    "link": "https://emilyliu1144.itch.io/the-trek"
  },
  {
    "title": "Indigo Veins",
    "projectType": "Solo Project",

    "projectDescription": "Indigo Veins is a singleplayer 3D top-down, point-and-click game where you travel towards your destination within a limited time. You are on your way to get your doses from the distribution center. During your journey, you've been wondering if it's worth living like this. Everyone living inside a monster's corpse while the outside world is still healing. And the only source of 'food' are the doses, harvested from the crystalized blood inside the monster's veins. Where ever you go, you'll have to choose before time runs out.",

    "projectCreation": "This was made with Godot for the Shortage Game Jam, hosted by the Game Dev and Design Club at Boise State University. The theme for the jam was 'Shortage' and submissions were individual, or with a group. My main goal of this project was to learn the Godot game engine.",

    "media": {
      "type": "image",
      "src": "../images/IndigoVeins.png",
      "title": "indigo veins"
    },
    "link": "https://emilyliu1144.itch.io/indigo-veins"
  },
  {
    "title": "Galactic Pizza Party",
    "projectType": "Solo Project",

    "projectDescription": "Galactic Pizza Party is singleplayer, open world VR game where you swing around the city like Spider-Man. You play as a delivery boy working for the pizza chain Galactic Pizza Party LLC and your job is to deliver pizzas to aliens. You're assigned to a planet with poor city planning that doesn't support vehicle and bike transportation. The company's solution? Equip their delivery boys with sticky gloves, wrist-mounted line launchers, and soft-landing boots! Drones would do a much better job, but they're expensive to maintain and are prone to theft. So, equip your gear and start delivering pizzas to those hungry customers!",

    "projectCreation": "This was made in Unity, built for the Meta Quest 2. 3D models were made using Autodesk Maya, Adobe Photoshop, and paint.NET.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/T9LZ_38E9D8",
      "title": "galacticpizzaparty"
    },
    "link": "n/a"
  },
  {
    "title": "Dust Devil Dale",
    "projectType": "Team Project",

    "projectDescription": "Dust Devil Dale is a 2-player, splitscreen co-op, side-scrolling beat 'em up game played with a custom Arduino controller and gamepad. You play as Dust Devil Dale, a sheriff who got his gold stolen by bandits. Fight off waves of enemies by punching and summoning lightning. Reach the end of the level to reclaim your gold!",

    "projectCreation": "This project was created with 3 other students, and made in Unreal Engine 5. We worked with a client, who has cerebral palsy, to create an accessible gaming controller made with Arduino for them to use. My contributions to the project were programming the player movement, fighting system, spline-based camera movement, enemy AI and spawning, splitscreen multiplayer, retarget and fix Mixamo animations, helping rig and import custom character models.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/nk_rBXpUbc4",
      "title": "dustdevildale"
    },
    "link": "n/a"
  },
  {
    "title": "Target Practice",
    "projectType": "Team Project",

    "projectDescription": "Target Practice is a 4-player, competitive multiplayer, FPS game played with LAN connectivity. Players are tasked to score points by moving around in a sci-fi arena finding and shooting the randomly spawning targets, while also avoiding axe-wielding enemies. All within a limited amount of time. When time is up, the player with the highest score wins.",

    "projectCreation": "This project was created with 3 other students, and made in Unreal Engine 5. My contributions to the project were programming player movement and shooting, LAN connectivity, and building the arena with free assets from the Fab store.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/VvFNgsMaoTU",
      "title": "targetpractice"
    },
    "link": "n/a"
  },
  {
    "title": "AR Photo Booth",
    "projectType": "Solo Project",

    "projectDescription": "AR Photo Booth is a Windows PC app where you can take photos, and interact with bears in a digital environment using AR body tracking. You can set the chroma key by clicking on the camera feed for selecting a specified color, and changing the slider values for the border and color feathering. Once it's set, you're now ready to take some pictures! The bears follow your head and wrists using MediaPipe Solutions' Body Tracking Model. When you move your head and hands near the top of the screen, the bears head towards the back of the scene. Moving them near the bottom of the screen, brings the bears closer to the camera. After pressing the button, a 5-second countdown will start and the snapped photo shows up on the second monitor. If you like the picture shown, you can save it and it will show up in the current folder of the app!",

    "projectCreation": "This project was created in Unity for a Special Topic Presentation with the purpose of teaching my peers how to create and use images in-game, and a little bit about MediaPipe. This project was showcased at Treefort South and GIMM's Senior Showcase in Spring 2025. The bear 3D model was created using Blender.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/ABnvYaRMUXU",
      "title": "arphotobooth"
    },
    "link": "n/a"
  },
  {
    "title": "Militant Mayhem",
    "projectType": "Solo Project",

    "projectDescription": "Militant Mayhem is a third-person arena shooter where you play as an orange man wielding a jet pack and laser gun. His mission is to defeat Big Big, a giant dancing soldier who dreams of making the sky pink. Jump, dash, and shoot your way around the arena to defeat the endlessly spawning (and screaming) enemies and complete your mission!",

    "projectCreation": "This project was made in Unreal Engine, and built for Windows PC. All the assets are from Fab, Epic Games's asset store front. The inspiration for this game were those bright colored mobile game ads, where the gameplay is bad on purpose, for the humor; and Earth Defense Force for the gameplay. The main goal of this project was to learn Unreal Engine.",

    "media": {
      "type": "video",
      "src": "https://www.youtube.com/embed/N_i4RHE14Go",
      "title": "militantmayhem"
    },
    "link": "https://emilyliu1144.itch.io/militant-mayhem"
  }
]
